mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xj/s6e2c2xj.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CRG" -->
    <peripheral>
      <name>CRG</name>
      <description>Clock Unit Registers</description>
      <version>B</version>
      <groupName>CRG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x60</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x74</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "CSV" -->
      <interrupt>
        <name>CSV</name>
        <value>0</value>
      </interrupt>
      <!-- INTERRUPT "TIM" -->
      <interrupt>
        <name>TIM</name>
        <value>59</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "SCM_CTL" -->
        <register>
          <name>SCM_CTL</name>
          <description>System Clock Mode Control Register [W]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FA</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCS" -->
            <field>
              <name>RCS</name>
              <description>Master clock switch control bits</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLLE" -->
            <field>
              <name>PLLE</name>
              <description>PLL oscillation enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOSCE" -->
            <field>
              <name>SOSCE</name>
              <description>Sub clock oscillation enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOSCE" -->
            <field>
              <name>MOSCE</name>
              <description>Main clock oscillation enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SCM_STR" -->
        <register>
          <name>SCM_STR</name>
          <description>System Clock Mode Status Register [W]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FA</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCM" -->
            <field>
              <name>RCM</name>
              <description>Master clock selection bits</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PLRDY" -->
            <field>
              <name>PLRDY</name>
              <description>PLL oscillation stable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SORDY" -->
            <field>
              <name>SORDY</name>
              <description>Sub clock oscillation stable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MORDY" -->
            <field>
              <name>MORDY</name>
              <description>Main clock oscillation stable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STB_CTL" -->
        <register>
          <name>STB_CTL</name>
          <description>Standby Mode Control Register [W]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "KEY" -->
            <field>
              <name>KEY</name>
              <description>Standby mode control write control bit</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SPL" -->
            <field>
              <name>SPL</name>
              <description>Standby pin level setting bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSTM" -->
            <field>
              <name>DSTM</name>
              <description>Deep standby mode select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STM" -->
            <field>
              <name>STM</name>
              <description>Standby mode selection bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RST_STR" -->
        <register>
          <name>RST_STR</name>
          <description>Reset Cause Register [W]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x000001F3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRST" -->
            <field>
              <name>SRST</name>
              <description>Software reset flag</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FCSR" -->
            <field>
              <name>FCSR</name>
              <description>Flag for anomalous frequency detection reset</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CSVR" -->
            <field>
              <name>CSVR</name>
              <description>Clock failure detection reset flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HWDT" -->
            <field>
              <name>HWDT</name>
              <description>Hardware watchdog reset flag</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SWDT" -->
            <field>
              <name>SWDT</name>
              <description>Software watchdog reset flag</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INITX" -->
            <field>
              <name>INITX</name>
              <description>INITX pin input reset flag</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PONR" -->
            <field>
              <name>PONR</name>
              <description>Power-on reset/low-voltage detection reset flag</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BSC_PSR" -->
        <register>
          <name>BSC_PSR</name>
          <description>Base Clock Prescaler Register [W]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BSR" -->
            <field>
              <name>BSR</name>
              <description>Base clock frequency division ratio setting bit</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "APBC0_PSR" -->
        <register>
          <name>APBC0_PSR</name>
          <description>APB0 Prescaler Register [W]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBC0" -->
            <field>
              <name>APBC0</name>
              <description>APB0 bus clock frequency division ratio setting bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "APBC1_PSR" -->
        <register>
          <name>APBC1_PSR</name>
          <description>APB1 Prescaler Register [W]</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0x00000093</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBC1EN" -->
            <field>
              <name>APBC1EN</name>
              <description>APB1 clock enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC1RST" -->
            <field>
              <name>APBC1RST</name>
              <description>APB1 bus reset control bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC1" -->
            <field>
              <name>APBC1</name>
              <description>APB1 bus clock frequency division ratio setting bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "APBC2_PSR" -->
        <register>
          <name>APBC2_PSR</name>
          <description>APB2 Prescaler Register [W]</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0x00000093</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "APBC2EN" -->
            <field>
              <name>APBC2EN</name>
              <description>APB2 clock enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC2RST" -->
            <field>
              <name>APBC2RST</name>
              <description>APB2 bus reset control bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "APBC2" -->
            <field>
              <name>APBC2</name>
              <description>APB2 bus clock frequency division ratio setting bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SWC_PSR" -->
        <register>
          <name>SWC_PSR</name>
          <description>Software Watchdog Clock Prescaler Register [W]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWDS" -->
            <field>
              <name>SWDS</name>
              <description>Software watchdog clock frequency division ratio setting bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
