mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xj/s6e2c2xj.svd
        <!-- REGISTER "IRQ049MON" -->
        <register>
          <name>IRQ049MON</name>
          <description>IRQ049 Batch Read Register [BHW]</description>
          <addressOffset>0x2C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BMEMCS" -->
            <field>
              <name>BMEMCS</name>
              <description>External bus output error interrupt request</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ050MON" -->
        <register>
          <name>IRQ050MON</name>
          <description>IRQ050 Batch Read Register [BHW]</description>
          <addressOffset>0x2CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCINT" -->
            <field>
              <name>RTCINT</name>
              <description>Interrupt request of the RTC$</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ051MON" -->
        <register>
          <name>IRQ051MON</name>
          <description>IRQ051 Batch Read Register [BHW]</description>
          <addressOffset>0x2D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ052MON" -->
        <register>
          <name>IRQ052MON</name>
          <description>IRQ052 Batch Read Register [BHW]</description>
          <addressOffset>0x2D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.9</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ053MON" -->
        <register>
          <name>IRQ053MON</name>
          <description>IRQ053 Batch Read Register [BHW]</description>
          <addressOffset>0x2D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.10</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ054MON" -->
        <register>
          <name>IRQ054MON</name>
          <description>IRQ054 Batch Read Register [BHW]</description>
          <addressOffset>0x2DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.11</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ055MON" -->
        <register>
          <name>IRQ055MON</name>
          <description>IRQ055 Batch Read Register [BHW]</description>
          <addressOffset>0x2E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.12</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ056MON" -->
        <register>
          <name>IRQ056MON</name>
          <description>IRQ056 Batch Read Register [BHW]</description>
          <addressOffset>0x2E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT" -->
            <field>
              <name>EXTINT</name>
              <description>Interrupt request of the external pin interrupt ch.13</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
