mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xj/s6e2c2xj.svd
        <!-- REGISTER "EP2C" -->
        <register>
          <name>EP2C</name>
          <description>EP2 Control Register [HW]</description>
          <addressOffset>0x212C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6040</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EPEN" -->
            <field>
              <name>EPEN</name>
              <description>Endpoint Enable bit</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TYPE" -->
            <field>
              <name>TYPE</name>
              <description>Endpoint Transfer Type Select bits</description>
              <msb>14</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIR" -->
            <field>
              <name>DIR</name>
              <description>Endpoint Transfer Direction Select bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMAE" -->
            <field>
              <name>DMAE</name>
              <description>DMA Automatic Transfer Enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NULE" -->
            <field>
              <name>NULE</name>
              <description>Null Automatic Transfer Enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STAL" -->
            <field>
              <name>STAL</name>
              <description>Endpoint Stall Setting bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PKS" -->
            <field>
              <name>PKS</name>
              <description>Packet Size Setting bits</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EP3C" -->
        <register derivedFrom="EP2C">
          <name>EP3C</name>
          <description>EP3 Control Register [HW]</description>
          <addressOffset>0x2130</addressOffset>
        </register>
        <!-- REGISTER "EP4C" -->
        <register derivedFrom="EP2C">
          <name>EP4C</name>
          <description>EP4 Control Register [HW]</description>
          <addressOffset>0x2134</addressOffset>
        </register>
        <!-- REGISTER "EP5C" -->
        <register derivedFrom="EP2C">
          <name>EP5C</name>
          <description>EP5 Control Register [HW]</description>
          <addressOffset>0x2138</addressOffset>
        </register>
        <!-- REGISTER "TMSP" -->
        <register>
          <name>TMSP</name>
          <description>Time Stamp Register [HW]</description>
          <addressOffset>0x213C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x07FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMSP" -->
            <field>
              <name>TMSP</name>
              <description>Time Stamp bits</description>
              <msb>10</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UDCS" -->
        <register>
          <name>UDCS</name>
          <description>UDC Status Register [BHW]</description>
          <addressOffset>0x2140</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SUSP" -->
            <field>
              <name>SUSP</name>
              <description>Suspend detection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOF" -->
            <field>
              <name>SOF</name>
              <description>SOF Detection bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BRST" -->
            <field>
              <name>BRST</name>
              <description>Bus Reset Detection bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WKUP" -->
            <field>
              <name>WKUP</name>
              <description>Wake-up Detection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SETP" -->
            <field>
              <name>SETP</name>
              <description>Setup Stage Detection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONF" -->
            <field>
              <name>CONF</name>
              <description>Configuration Detection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UDCIE" -->
        <register>
          <name>UDCIE</name>
          <description>UDC Interrupt Enable Register [BHW]</description>
          <addressOffset>0x2141</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SUSPIE" -->
            <field>
              <name>SUSPIE</name>
              <description>Suspend Interrupt Enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOFIE" -->
            <field>
              <name>SOFIE</name>
              <description>SOF Reception Interrupt Enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BRSTIE" -->
            <field>
              <name>BRSTIE</name>
              <description>Bus Reset Enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WKUPIE" -->
            <field>
              <name>WKUPIE</name>
              <description>Wake-up Interrupt Enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONFN" -->
            <field>
              <name>CONFN</name>
              <description>Configuration Number Indication bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CONFIE" -->
            <field>
              <name>CONFIE</name>
              <description>Configuration Interrupt Enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
