mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xj/s6e2c2xj.svd
        <!-- REGISTER "TXVLANFRAMES_G" -->
        <register>
          <name>TXVLANFRAMES_G</name>
          <description>Number of good VLAN frames transmitted exclusive of retried frames [BHW]</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXFRAMECOUNT_GB" -->
        <register>
          <name>RXFRAMECOUNT_GB</name>
          <description>Number of good and bad frames received [BHW]</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXOCTETCOUNT_GB" -->
        <register>
          <name>RXOCTETCOUNT_GB</name>
          <description>Number of bytes received (exclusive of preamble) in good and bad frames. [BHW]</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXOCTETCOUNT_G" -->
        <register>
          <name>RXOCTETCOUNT_G</name>
          <description>Number of bytes received (exclusive of preamble) only in good frames [BHW]</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXBROADCASTFRAMES_G" -->
        <register>
          <name>RXBROADCASTFRAMES_G</name>
          <description>Number of good broadcast frames received [BHW]</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXMULTICASTFRAMES_G" -->
        <register>
          <name>RXMULTICASTFRAMES_G</name>
          <description>Number of good multicast frames received [BHW]</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXCRCERROR" -->
        <register>
          <name>RXCRCERROR</name>
          <description>Number of frames received with CRC error[BHW]</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXALLIGNMENTERROR" -->
        <register>
          <name>RXALLIGNMENTERROR</name>
          <description>Number of frames received with alignment (dribble) error. Valid only in 10/100 mode [BHW]</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXRUNTERROR" -->
        <register>
          <name>RXRUNTERROR</name>
          <description>Number of frames received with runt (64 bytes and CRC error) error [BHW]</description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXJABBERERROR" -->
        <register>
          <name>RXJABBERERROR</name>
          <description>Number of frames received with length greater than 1518 bytes with CRC error [BHW]</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXUNDERSIZE_G" -->
        <register>
          <name>RXUNDERSIZE_G</name>
          <description>Number of frames received with length less than 64 bytes without any errors. [BHW]</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXOVERSIZE_G" -->
        <register>
          <name>RXOVERSIZE_G</name>
          <description>Number of frames received with length greater than the maxsize without error [BHW]</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX64OCTETS_GB" -->
        <register>
          <name>RX64OCTETS_GB</name>
          <description>Number of good and bad frames received with length 64 bytes exclusive of preamble [BHW]</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX65TO127OCTETS_GB" -->
        <register>
          <name>RX65TO127OCTETS_GB</name>
          <description>Number of good and bad frames received with length between 65 and 127 (inclusive) bytes exclusive of preamble. [BHW]</description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX128TO255OCTETS_GB" -->
        <register>
          <name>RX128TO255OCTETS_GB</name>
          <description>Number of good and bad frames received with length between 128 and 255 (inclusive) bytes exclusive of preamble. [BHW]</description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX256TO511OCTETS_GB" -->
        <register>
          <name>RX256TO511OCTETS_GB</name>
          <description>Number of good and bad frames received with length between 256 and 511 (inclusive) bytes exclusive of preamble. [BHW]</description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
