mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xj/s6e2c2xj.svd
        <!-- REGISTER "RXIPV6_HDRERR_FRMS" -->
        <register>
          <name>RXIPV6_HDRERR_FRMS</name>
          <description>Number of IPv6 datagrams received with header errors (length or version mismatch) [BHW]</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV6_NOPAY_FRMS" -->
        <register>
          <name>RXIPV6_NOPAY_FRMS</name>
          <description>Number of IPv6 datagram frames received that did not have a TCP/UDP or ICMP payload. This includes all IPv6 datagrams with fragmentation or security extension headers [BHW]</description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXUDP_GD_FRMS" -->
        <register>
          <name>RXUDP_GD_FRMS</name>
          <description>Number of good IP datagrams with a good UDP payload. This counter is not updated when the rxipv4_udsbl_frms counter is incremented [BHW]</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXUDP_ERR_FRMS" -->
        <register>
          <name>RXUDP_ERR_FRMS</name>
          <description>Number of good IP datagrams whose UDP payload has a checksum error [BHW]</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXTCP_GD_FRMS" -->
        <register>
          <name>RXTCP_GD_FRMS</name>
          <description>Number of good IP datagrams with a good TCP payload [BHW]</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXTCP_ERR_FRMS" -->
        <register>
          <name>RXTCP_ERR_FRMS</name>
          <description>Number of good IP datagrams whose TCP payload has a checksum error [BHW]</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXICMP_GD_FRMS" -->
        <register>
          <name>RXICMP_GD_FRMS</name>
          <description>Number of good IP datagrams with a good ICMP payload [BHW]</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXICMP_ERR_FRMS" -->
        <register>
          <name>RXICMP_ERR_FRMS</name>
          <description>Number of good IP datagrams whose ICMP payload has a checksum error [BHW]</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_GD_OCTETS" -->
        <register>
          <name>RXIPV4_GD_OCTETS</name>
          <description>Number of bytes received in good IPv4 datagrams encapsulating TCP/UDP or ICMP data. (Ethernet header/FCS/pad or IP pad bytes are not included in this counter or in the octet counters listed below). [BHW]</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_HDRERR_OCTETS" -->
        <register>
          <name>RXIPV4_HDRERR_OCTETS</name>
          <description>Number of bytes received in IPv4 datagrams with header errors (checksum/length version mismatch). The value in the Length field of IPv4 header is used to update this counter [BHW]</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_NOPAY_OCTETS" -->
        <register>
          <name>RXIPV4_NOPAY_OCTETS</name>
          <description>Number of bytes received in IPv4 datagrams that did not have a TCP/UDP or ICMP payload. The value in the IPv4 header's Length field is used to update this counter [BHW]</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_FRAG_OCTETS" -->
        <register>
          <name>RXIPV4_FRAG_OCTETS</name>
          <description>Number of bytes received in fragmented IPv4 datagrams. The value in the IPv4 header's Length field is used to update this counter [BHW]</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_UDSBL_OCTETS" -->
        <register>
          <name>RXIPV4_UDSBL_OCTETS</name>
          <description>Number of bytes received in a UDP segment that had the UDP checksum disabled. This counter does not count IP Header bytes [BHW]</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV6_GD_OCTETS" -->
        <register>
          <name>RXIPV6_GD_OCTETS</name>
          <description>Number of bytes received in good IPv6 datagrams encapsulating TCP/UDP or ICMPv6 data [BHW]</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
